/******************************************************************************/
/* src/mterm.h                                                                */
/*                                                                 2018/10/05 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
#ifndef MTERM_H
#define MTERM_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stddef.h>
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 機能ID */
#define MTERM_FUNC_OUTPUT   ( 0x00000001 )  /* 出力 */
#define MTERM_FUNC_INPUT    ( 0x00000002 )  /* 入力 */

/** メッセージヘッダ */
typedef struct {
    uint32_t funcId;        /**< 機能ID   */
    size_t   length;        /**< データ長 */
} MtermMsgHdr_t;

/** 出力メッセージ */
typedef struct {
    MtermMsgHdr_t header;   /**< ヘッダ */
    char          data[];   /**< データ */
} MtermMsgOutput_t;

/** 入力メッセージ */
typedef struct {
    MtermMsgHdr_t header;   /**< ヘッダ         */
    uint32_t      scan;     /**< スキャンコード */
} MtermMsgInput_t;


/******************************************************************************/
#endif
